# RBS Salary Fum Rank

In [1]:
import pandas as pd

In [2]:
salary = pd.read_csv('../Capstone_csv_file/salary_edited_to_fit_17-18')

In [3]:
rbs = pd.read_csv('../Capstone_csv_file/rbs_fum_rank_17-18')

In [4]:
rbs

               NAME  FUM  FUM_rank
0        Eddie Lacy    0      17.5
1   Giovani Bernard    0      17.5
2        Dion Lewis    0      17.5
3     Elijhaa Penny    0      17.5
4     Chris Johnson    0      17.5
..              ...  ...       ...
93     Alex Collins    4      95.0
94  Devonta Freeman    4      95.0
95     Duke Johnson    4      95.0
96      Todd Gurley    5      97.0
97    Jalen Richard    8      98.0

[98 rows x 3 columns]

In [5]:
rbs.set_index('NAME', inplace = True)

In [6]:
rbs_final_salary = rbs.merge(salary, on = 'NAME')

In [7]:
rbs_final_salary.set_index('NAME', inplace = True)

In [8]:
rbs_final_salary.head()

                 FUM  FUM_rank   salary
NAME
Eddie Lacy         0      17.5  4250000
Giovani Bernard    0      17.5  5166667
Dion Lewis         0      17.5  1300000
Damien Williams    0      17.5  1797000
Robert Turbin      0      17.5  1350000

In [9]:
rbs_final_salary.to_csv('../Capstone_csv_file/rbs_fum_salary_17-18')